---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSettings.IsValidSpecificFittingAngle(System.Double)
source: html/4bfcf63d-bb63-a480-0487-a1d75f1308f7.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.IsValidSpecificFittingAngle Method

Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.

## Syntax (C#)
```csharp
public bool IsValidSpecificFittingAngle(
	double angle
)
```

## Parameters
- **angle** (`System.Double`) - The angle value (in degree).

## Returns
True if the given value is a valid specific fitting angle.